import { StateUpdater, useState } from "preact/hooks";

const REQUIRED_POLICY = 1;

export const ConsentForm = ({
  setAcceptConsent,
}: {
  setAcceptConsent: StateUpdater<boolean>,
}) => {
  const [acceptedPolicy, setAcceptedPolicy] = useState<boolean[]>(Array(REQUIRED_POLICY).fill(false));

  const handleAcceptPolicy = (event: Event, policy: number) => {
    if (!(event.target instanceof HTMLInputElement)) return;
    acceptedPolicy[policy] = !acceptedPolicy[policy];
    setAcceptedPolicy(acceptedPolicy.slice());
  };

  const handleAcceptConsent = () => {
    const consentAccepted = (acceptedPolicy.every((policy) => policy === true));
    setAcceptConsent(consentAccepted);
  };

  return (
    <div className="relative h-full flex justify-center items-center mt-12 md:px-12">
      <div className="flex flex-col p-5 md:p-10 bg-white bg-opacity-20 drop-shadow-lg rounded-lg z-20">
        <div className="text-lg md:text-3xl font-semibold text-white text-center mb-5">นโยบายข้อมูลส่วนบุคคล</div>

        <p className="text-sm bg-white h-72 sm:h-96 overflow-y-auto rounded-lg p-4 mb-4">
          <p className="font-semibold">นโยบายข้อมูลส่วนบุคคล</p> <br />

          1. ข้อมูลสำคัญเกี่ยวกับโครงการ <br/>
          <ul class="ml-4">
            <li>
              1. โครงการแข่งขันแก้ไขปัญหาด้วยการเขียนโปรแกรมคอมพิวเตอร์ ระดับมัธยมศึกษาตอนปลาย ปีการศึกษา 2565 หรือ BangMod Hackathon 2023 ซึ่งต่อจากนี้จะเรียกว่า "โครงการ" ดำเนินการโดยคณะทำงานโครงการ ซึ่งต่อจากนี้จะเรียกว่า “คณะทำงาน”
            </li>
            <li>
              2. คณะทำงานเป็นผู้ให้บริการเว็บไซต์ bangmodhackathon.com และเว็บไซต์ที่เกี่ยวข้อง ซึ่งต่อจากนี้จะเรียกรวมว่า "เว็บไซต์"
            </li>
              3. ผู้ใช้งานเว็บไซต์ ซึ่งต่อจากนี้จะเรียกว่า “ท่าน” หรือ “คุณ” เป็นบุคคลหรือผู้แทนที่มีสิทธิในการยินยอมให้ข้อมูลส่วนบุคคลของบุุคคลทั้งหมด
            <li>
              4. เนื่องด้วยโครงการได้เห็นความสำคัญของการรักษาข้อมูลส่วนบุคคลของผู้ใช้ จึงได้กำหนดนโยบายความเป็นส่วนตัวนี้ขึ้น เพื่อกำหนดความมุ่งมั่นของโครงการต่อความเป็นส่วนตัวของผู้ใช้งาน รวมถึงชี้แจงให้ทราบเกี่ยวกับกระบวนวิธีการ การเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลในโครงการ ดังนั้นกรุณาอ่านนโยบายความเป็นส่วนตัวนี้โดยละเอียด โดยเมื่อเข้าใช้งานเว็บไซต์ของโครงการ และยอมรับนโยบายที่เกี่ยวข้องนี้ อย่างชัดเจน จะถือว่าท่านรับทราบและยอมรับข้อกำหนดนโยบายข้อมูลส่วนบุคคลนี้แล้ว หากท่านไม่ยอมรับนโยบายข้อมูลส่วนบุคคล ท่านจะไม่สามารถทำการสมัครผ่านเว็บไซต์ของโครงการได้
            </li>
          </ul>

          <br />

          2. ข้อมูลส่วนบุคคล หรือ ข้อความส่วนบุคคลที่โครงการเก็บรวบรวมเกี่ยวกับผู้ใช้ ซึ่งเป็นข้อมูลที่ทำให้สามารถระบุตัวตนของท่านได้ อาจทำการเก็บรวบรวม ใช้ และถ่ายโอนข้อมูลส่วนบุคคลประเภทต่าง ๆ ที่เกี่ยวกับผู้ใช้ตามที่โครงการได้จัดกลุ่มไว้ด้วยกัน ดังต่อไปนี้
          <ul class="ml-4">
            <li>
                1. ข้อมูลส่วนตัว ได้แก่ ชื่อ นามสกุล ชื่อเล่น วันเดือนปีเกิด เบอร์โทรศัพท์ รูปถ่าย  สำเนาบัตรประชาชนของท่าน ไลน์ และอีเมลเพื่อใช้สำหรับการติดต่อ รวมไปถึงอาหาร/ยาที่แพ้และโรคประจำตัว
            </li>
            <li>
              2. ข้อมูลการศึกษา ได้แก่ ใบรับรองผลการศึกษา (ปพ.7) ระดับการศึกษา หลักสูตร ชื่อสถานศึกษาและจังหวัด
            </li>
          </ul>

          <br />

          3. โครงการอาจเก็บรวบรวมข้อมูลเกี่ยวกับผู้ใช้หลายวิธี ได้แก่ การเก็บข้อมูลปฏิสัมพันธ์โดยตรง การกรอกแบบฟอร์มบนเว็บไซต์รับสมัครของโครงการ เพื่อทำการสมัครเข้าร่วมโครงการ เป็นต้น
          <ul class="ml-4">
            <li>
              1. เทคโนโลยีอัตโนมัติหรือปฏิสัมพันธ์
              ในขณะที่ท่านโต้ตอบกับเว็บไซต์ของโครงการ ระบบเทคโนโลยีอัตโนมัติโครงการใช้งานบนเว็บไซต์อาจรวบรวมข้อมูลทางเทคนิค เช่น ข้อมูลเกี่ยวกับเบราว์เซอร์ของท่านโดยอัตโนมัติ ว่าท่านเข้าเยี่ยมชมพื้นที่ใดบนเว็บไซต์ของโครงการและลิงก์ที่ท่านคลิกดูเหตุการณ์ ช่วยให้โครงการสามารถส่งมอบประสบการณ์ที่ดีแก่ท่านเมื่อท่านเข้าชมเว็บไซต์ของโครงการ และยังช่วยให้โครงการสามารถปรับปรุงพัฒนาเว็บไซต์ให้ดียิ่งขึ้น
            </li>
            <li>
              2. บุคคลที่สาม หรือ แหล่งข้อมูลสาธารณะ โครงการจะเก็บข้อมูลของผู้ใช้ผ่านการเข้าสู่ระบบโดยใช้สื่อสังคมออนไลน์ ทำให้โครงการอาจเก็บรวบรวมข้อมูลการติดต่อ อัตลักษณ์ และข้อมูลทางเทคนิค รวมไปถึง ชื่อผู้ใช้งาน รูปประจำตัวผู้ใช้งาน และ อีเมล ข้อมูลเกี่ยวกับสื่อสังคมออนไลน์ที่ท่านยินยอมเปิดเผยกับโครงการจะไปรวมกับข้อมูลที่ผู้ใช้ให้กับโครงการไว้ หรือที่โครงการรวบรวมไว้เกี่ยวกับท่าน
            </li>
          </ul>

          <br />
          
          4. วัตถุประสงค์ของการใช้ข้อมูลส่วนบุคคล
          โครงการมีวัตถุประสงค์ในการใช้ข้อมูล ดังต่อไปนี้
          <ul class="ml-4">
            <li>1. โครงการใช้ข้อมูลส่วนบุคคลเพื่อยืนยันคุณสมบัติและคัดเลือกผู้เข้าร่วมโครงการ</li>
            <li>2. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดกิจกรรมในโครงการ</li>
            <li>3. โครงการใช้ข้อมูลส่วนบุคคลเพื่อจัดทำใบประกาศนียบัตรสำหรับผู้ที่เข้าร่วมโครงการ</li>
            <li>4. โครงการใช้ข้อมูลส่วนบุคคลเพื่อให้สามารถติดต่อผู้ดูแลได้ในกรณีฉุกเฉิน</li>
            <li>5. โครงการใช้ข้อมูลแบบไม่ระบุตัวตน และข้อมูลเทคโนโลยีอัตโนมัติเพื่อใช้ในการวิเคราะห์ข้อมูลทางสถิติ</li>
          </ul>

          <br />
          
          5. ระยะเวลาในการเก็บข้อมูลส่วนบุคคล
          <p className="ml-4">
            โครงการจะเก็บข้อมูลส่วนบุคคลของท่านเท่าที่จำเป็น ในการจัดโครงการครั้งปัจจุบัน และสำหรับโครงการครั้งถัดไป โดยไม่เกิน 4 ปี
          </p>

          <br />
          
          6. สิทธิของท่านเกี่ยวกับข้อมูลส่วนบุคคล
          <p className="ml-4">
            ท่านสามารถใช้สิทธิที่ท่านมีอยู่ตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล อันรวมถึงการเข้าถึง การแก้ไข การลบ และระงับการประมวลผลข้อมูลส่วนบุคคล โดยติดต่อผ่านทางผู้ดูแลข้อมูลของโครงการ ได้ที่อีเมล {`{natasha.dej@kmutt.ac.th}`}
          </p>
        </p>

        <div className="flex flex-col px-4">
          <div className="flex flex-row items-center space-x-2">
            <input
              id="policy-1"
              name="policy-1"
              type="radio"
              className="w-5 h-5"
              onClick={(event) => handleAcceptPolicy(event, 0)}
              checked={acceptedPolicy[0]}
            />
            <label for="policy-1" className="text-white">ยินยอมข้อตกลงนโยบายข้อมูลส่วนบุคคล</label>
          </div>
        </div>

        <button
          onClick={handleAcceptConsent}
          className="px-12 py-3 text-white disabled:text-white/50 bg-violet-500 hover:bg-violet-600 disabled:bg-violet-500/50 disabled:hover:bg-violet-500/50 rounded-lg mt-4 shadow-lg"
          disabled={(acceptedPolicy.every((policy) => policy === false))}
        >
          ยอมรับ
        </button>
      </div>
    </div>
  );
};
